[{
  "eventName": "Software Engineering Intern",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "May 2017 - August 2017",
  "image": "../images/logos/keyo-blue.svg",
  "responsibilities": "During this internship I mainly worked on developing the frontend in React Native for Keyo's mobile app which had not yet been released to the public.",
  "tech_stack": "React Native, React + libraries",
  "links": "",
  "rank": 4,
  "highlights": ["Did extensive frontend work for React Native app", "Self-taught Javascript and React Native"]
}, {
  "eventName": "Software Engineering Intern",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "May 2018 - August 2018",
  "image": "../images/logos/keyo-blue.svg",
  "tech_stack": "React Native, React + libraries, NodeJS, PostgreSQL",
  "responsibilities": "During this internship I worked on a few full-stack features for Keyo's mobile app. Being new to full-stack development, much of my time was spent learning how to implement RESTful APIs, use ORMs (Sequelize in this case), and use Redux in the frontend.",
  "links": "",
  "rank": 3,
  "highlights": ["Implemented a full-stack feature intended to make paying rent easier for tenants by improving the front-end design.", "Self-taught RESTful API development, Express.js, Sequelize ORM, and Redux"]
}, {
  "eventName": "Software Engineer",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "August 2019 - Oct 2020",
  "image": "../images/logos/keyo-blue.svg",
  "summary": "Keyo is a real-estate startup focused on the NYC rental market. It helps save landlords money by filling apartment vacancies faster than a traditional brokerage. Keyo was acquired by Zillow in October 2020.",
  "tech_stack": "React Native, React + libraries, NodeJS, TypeScript, PostgreSQL, AWS (S3, Cloudfront, EC2, Route53), various CI tools",
  "responsibilities": "Part of a five-person team that developed two mobile apps and two web apps for several stakeholders in the real-estate industry. This being a small team and working in a fast-paced startup environment, I wore multiple hats that involved day-to-day feature development and bug fixes, setup and maintenance of CI/CD pipelines on various platforms, and setup and maintenance of our technical infrastructure, such as servers, databases, cloud storage, and networking infrastructure, on platforms like AWS and Cloudflare.",
  "links": "",
  "rank": 2,
  "highlights": ["Built a custom video-chat feature in Keyo's mobile app and consumer-facing website using Twilio to facilitate virtual tours in response to COVID-19.", "Developed multiple features for map-based searching on keyo.com, including ability to search for rentals near NYC transit lines. This involved scouring the internet for open-source NYC transit data and creating scripts with Python to format the data suitably for our use case.", "Migrated entire DNS configuration from Cloudflare to AWS Route 53 with zero downtime"]
}, {
  "eventName": "Software Development Engineer",
  "company": "Zillow Group Inc - StreetEasy",
  "location": "New York, NY",
  "date": "Oct 2020 - Jan 2022",
  "image": "../images/logos/zillow.svg",
  "summary": "Zillow Group is an online real-estate company who's mission is to provide a simpler way to buy, sell, and rent a new home. It owns and operates a portfolio of real-estate brand such as StreetEasy, Trulia, and OutEast. ",
  "tech_stack": "React Native, React + libraries (ESLint, Redux, etc.), Ruby on Rails, NodeJS, TypeScript, PostgreSQL, MySQL, Docker, various CI tools",
  "responsibilities": "Part of a team responsible for introducing an on-demand touring feature on StreetEasy, and a related mobile application for real estate agents and web app for StreetEasy's customer service team. The mobile app and web app were originally developed at Keyo (see below) and then integrated into StreetEasy's tech stack following the acquisition of Keyo in October 2020. Also have contributed various full-stack features to streeteasy.com.",
  "links": "",
  "rank": 1,
  "highlights": [
    "Lead a two month project across multiple teams to implement Pact.io, an contract testing framework used to test interactions between disparate communicating systems. The goal of the project was to implement contract testing between streeteasy.com and Keyo's existing backend server. Since completion, I have given multiple talks across the organization to evangelize the use of Pact.io.",
    "Migrated our mobile app's CI/CD pipeline from Bitrise.io to GitLab CI, resulting in a 3x speedup in build time. "
  ]
}, {
  "eventName": "Software Engineer",
  "company": "Titan",
  "location": "New York, NY",
  "date": "May 2022 - Present",
  "tech_stack": "React Native, React, ChakraUI, GraphQL, NodeJS, TypeScript, MongoDB",
  "summary": "Titan is a modern investment manager right in the palm of your hand. Their goal is to lead the world to better wealth through by offering a suite of investment products that typically are accessible only to the ultra-wealthy ",
  "responsibilities": "Originally my team's main responsibility was to develop features for user journeys that were not directly related to investing through the app. This included: creating a cross-platform onboarding experience for our users, developing a referral program for users in the app, and developing various features that allowed users to have a taste of our offerings before actually using our app. Later on, my team started also working on features that were directly related to investing through the app. ",
  "links": "",
  "rank": 0,
  "highlights": [
    "Co-lead project to build and launch Titan's web app in NextJS, which gave users the ability to use Titan on the web. Previously, Titan only offered a mobile app.",
    "Lead project to update Titan's referral programs, such as fee-waives and cash rewards",
    "Co-lead project to update Titan's onboarding flow, allowing users to seamlessly onboard on both our web and mobile platforms",
    "Lead project that allowed users to receive a recommended investment portfolio before actually investing in the app"
  ]
}]
