[{
  "eventName": "Software Engineering Intern",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "May 2017 - Aug 2017",
  "image": "../images/logos/keyo-blue.svg",
  "responsibilities": "During this internship I mainly worked on developing the frontend in React Native for Keyo's mobile app which had not yet been released to the public.",
  "tech_stack": "React Native, React + libraries",
  "links": "",
  "rank": 4,
  "highlights": ["Developed the frontend for Keyo’s React Native app that hadn’t yet been released to the public."]
}, {
  "eventName": "Software Engineering Intern",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "May 2018 - Aug 2018",
  "image": "../images/logos/keyo-blue.svg",
  "tech_stack": "React Native, React + libraries, NodeJS, PostgreSQL",
  "responsibilities": "During this internship I worked on a few full-stack features for Keyo's mobile app. Being new to full-stack development, much of my time was spent learning how to implement RESTful APIs, use ORMs (Sequelize in this case), and use Redux in the frontend.",
  "links": "",
  "rank": 3,
  "highlights": ["Implemented a full-stack feature in a React Native app that improved the rent payment history experience for users, displaying past, failed, incomplete, and overdue payments.", "Led a project to refactor the code using Redux for better coding practices."]
}, {
  "eventName": "Full Stack Engineer",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "Aug 2019 - Oct 2020",
  "image": "../images/logos/keyo-blue.svg",
  "summary": "Keyo was a real-estate startup focused on the NYC rental market. It provided on-demand touring for apartments in NYC, placing tenants faster than a traditional brokerage and helping landlords save money. The Keyo team was acquired by Zillow in October 2020.",
  "tech_stack": "TypeScript, React Native, React, Redux, SQL, AWS, YAML",
  "responsibilities": "Part of a five-person team that developed two React Native apps and two React apps for stakeholders in the real-estate industry. Day-to-day responsibilities included feature development and bug fixes, development of CI/CD pipelines, and development technical infrastructure, such as servers, databases, cloud storage, and networking infrastructure, on AWS and Cloudflare.",
  "links": "",
  "rank": 2,
  "highlights": ["Worked cross-functionally to develop app for users to schedule on-demand apartment viewings in NYC.",
    "Worked cross-functionally to develop app for partners to list apartments on Keyo and receive live tour updates.",
    "Worked cross-functionally to develop tool for ops team to list apartments, schedule tours, and process leases.",
    "Developed PSQL / PostGIS feature which enabled users to search for apartment listings on an interactive map.",
    "Developed a custom video-chat feature for virtual apartment showings which increased showings by 10% during COVID-19. Worked with CEO and tour providers to address bugs in real-time."
  ]
}, {
  "eventName": "Full Stack Engineer",
  "company": "Zillow Group Inc - StreetEasy",
  "location": "New York, NY",
  "date": "Oct 2020 - Jan 2022",
  "image": "../images/logos/zillow.svg",
  "summary": "StreetEasy is New York City’s leading real estate marketplace.",
  "tech_stack": "TypeScript, React Native, React, Redux, Ruby on Rails, SQL",
  "responsibilities": "Member of team acquired by Zillow responsible for introducing an on-demand touring feature on StreetEasy, associated mobile application for real estate agents, and internal tool for StreetEasy's CX team.",
  "links": "",
  "rank": 1,
  "highlights": [
    "Co-developed feature which enabled on-demand apartment viewings for 30+ StreetEasy listings.",
    "Lead project to re-skin Keyo’s mobile app to more closely align with StreetEasy’s design system.",
    "Lead three-person project to implement a testing library between streeteasy.com and Keyo API.",
    "Worked with DevOps team to migrate mobile infrastructure platform, resulting in 3x build speedup time."
  ]
}, {
  "eventName": "Software Engineer - Growth",
  "company": "Titan",
  "location": "New York, NY",
  "date": "May 2022 - Sept 2023",
  "tech_stack": "TypeScript, React, React Native, MongoDB, Apollo GraphQL",
  "summary": "Titan is reimagining investment management from the ground up, by offering investment products that typically are accessible only to the ultra-wealthy.",
  "responsibilities": "Responsible for a variety of full-stack features across web and native platforms. Collaborated closely with product, design, marketing, and CX teams to define project scope, ensure successful rollout, and fix bugs.",
  "links": "",
  "rank": 0,
  "highlights": [
    "Co-lead development on multi-engineer project to build Titan’s web platform. Web signups had a 40% conversion rate vs. 36% on iOS.",
    "Co-lead development of cross-platform onboarding experience, increasing conversions by 7%.",
    "Implemented a fee-offset referral program that doubled successful referrals over a one month period.",
    "Worked with marketing team to run experiment providing users with an investing portfolio recommendation before app sign-up, using Mode to test conversion rate compared to standard sign-up flow."
  ]
}]
