[{
  "eventName": "Software Engineering Intern",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "May 2017 - Aug 2017",
  "image": "../images/logos/keyo-blue.svg",
  "responsibilities": "During this internship I mainly worked on developing the frontend in React Native for Keyo's mobile app which had not yet been released to the public.",
  "tech_stack": "React Native, React + libraries",
  "links": "",
  "rank": 4,
  "highlights": ["Did extensive frontend work for React Native app", "Self-taught Javascript and React Native"]
}, {
  "eventName": "Software Engineering Intern",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "May 2018 - Aug 2018",
  "image": "../images/logos/keyo-blue.svg",
  "tech_stack": "React Native, React + libraries, NodeJS, PostgreSQL",
  "responsibilities": "During this internship I worked on a few full-stack features for Keyo's mobile app. Being new to full-stack development, much of my time was spent learning how to implement RESTful APIs, use ORMs (Sequelize in this case), and use Redux in the frontend.",
  "links": "",
  "rank": 3,
  "highlights": ["Implemented a full-stack feature intended to make paying rent easier for tenants by improving the front-end design.", "Self-taught RESTful API development, Express.js, Sequelize ORM, and Redux"]
}, {
  "eventName": "Software Engineer",
  "company": "Keyo",
  "location": "Palo Alto, CA",
  "date": "Aug 2019 - Oct 2020",
  "image": "../images/logos/keyo-blue.svg",
  "summary": "Keyo was a real-estate startup focused on the NYC rental market. It provided on-demand touring for apartments in NYC, placing tenants faster than a traditional brokerage and helping landlords save money. The Keyo team was acquired by Zillow in October 2020.",
  "tech_stack": "TypeScript, React Native, React, Redux, SQL, AWS, YAML",
  "responsibilities": "Part of a five-person team that developed two React Native apps and two React apps for stakeholders in the real-estate industry. Day-to-day responsibilities included feature development and bug fixes, development of CI/CD pipelines, and development technical infrastructure, such as servers, databases, cloud storage, and networking infrastructure, on AWS and Cloudflare.",
  "links": "",
  "rank": 2,
  "highlights": ["Built a custom video-chat feature using Twilio to facilitate virtual tours in response to COVID-19.", "Developed multiple features for map-based searching on keyo.com, including ability to search for rentals near NYC transit lines. This involved scouring the internet for open-source NYC transit data and creating scripts with Python to format the data suitably for our use case.", "Migrated entire DNS configuration from Cloudflare to AWS Route 53 with zero downtime"]
}, {
  "eventName": "Software Development Engineer",
  "company": "Zillow Group Inc - StreetEasy",
  "location": "New York, NY",
  "date": "Oct 2020 - Jan 2022",
  "image": "../images/logos/zillow.svg",
  "summary": "Zillow Group is an online real-estate company who's mission is to provide a simpler way to buy, sell, and rent a new home. It owns and operates a portfolio of real-estate brand such as StreetEasy, Trulia, and OutEast. ",
  "tech_stack": "TypeScript, React Native, React, Redux, Ruby on Rails, SQL",
  "responsibilities": "Member of team acquired by Zillow responsible for introducing an on-demand touring feature on StreetEasy, associated mobile application for real estate agents, and internal tool for StreetEasy's CX team.",
  "links": "",
  "rank": 1,
  "highlights": [
    "Developed React Native app for real-estate agents and React internal tool for StreetEasy's CX team",
    "Lead project across two teams to implement Pact.io into StreetEasy's CI/CD pipeline",
    "Migrated team's mobile apps CI/CD pipeline from Bitrise.io to GitLab CI, resulting in a 3x speedup in build time"
  ]
}, {
  "eventName": "Software Engineer - Growth",
  "company": "Titan",
  "location": "New York, NY",
  "date": "May 2022 - Sept 2023",
  "tech_stack": "TypeScript, React, React Native, MongoDB, Apollo GraphQL",
  "summary": "Titan is reimagining investment management from the ground up, by offering investment products that typically are accessible only to the ultra-wealthy.",
  "responsibilities": "Responsible for a variety of full-stack features across web and native platforms. Collaborated closely with product, design, marketing, and CX teams to define project scope, ensure successful rollout, and fix bugs.",
  "links": "",
  "rank": 0,
  "highlights": [
    "Co-lead development of Titan’s web platform. Web signups had a 40% conversion rate vs. 36% on iOS app",
    "Co-lead development of GQL powered form package to dynamically generate React UIs, supporting both web and native. Used in multiple cross-platform experiences including onboarding flow and 401k rollover flow",
    "Lead development for new referral program, implementing two new reward structures for successful referrals",
    "Lead development of feature which allowed users to receive an investing portfolio recommendation on titan.com"
  ]
}]
